# შექმენით კალკულატორის ფუნქცია რომელსაც ექნება სამი პარამეტრი პირველი რიცხვი, მეორე რიცხვი და მოქმედება თუ რა მოქმედება უნდა რომ შესრულდეს ამ ორ რიცხვს შორის რიცხვებიდან და 
# მათემატიკური ოპერატორიდან გამომდინარე დაგიბრუნოთ პასუხი, თუ მაგალითად მომხმარებელამ შემოიტანა 5 და 10 ხოლო მას უნდა ამ ორი რიცხვის დამატება ანუ მესამე პარამეტრი არის "+" პლიუსი ეს
#  ორი რიცხვი შეიკრიბოს 5 + 10 = 15

num1=int(input("enter num1:",))
num2=int(input("enter num2:",))

def kalkulatori(num1, num2):
    user=input("enter * + % - :",)
    if user == "%":
        print(num1 % num2)
        
    elif user == "-":
        print(num1 - num2)

    elif user == "+":
        print(num1 + num2)

    elif user == "*":
        print(num1 * num2)

kalkulatori(num1,  num2)